In [5]:
import pandas as pd
import numpy as np

In [6]:
dict1 = {
    "name": ["shriram", "shrenik", "shivraj", "sushant"],
    "college": ["PCCOE", "Janta", "COEP", "DYP"],
    "Role": ["Data Scientist", "Silver Business", "Electrical Engineer", "Silver Business"]
}

In [7]:
df = pd.DataFrame(dict1)

In [8]:
df

      name college                 Role
0  shriram   PCCOE       Data Scientist
1  shrenik   Janta      Silver Business
2  shivraj    COEP  Electrical Engineer
3  sushant     DYP      Silver Business

In [9]:
df.to_csv("friends.csv")

In [10]:
df.to_csv("friends_noIndex.csv", index=False)

In [11]:
df.head(2)

      name college             Role
0  shriram   PCCOE   Data Scientist
1  shrenik   Janta  Silver Business

In [12]:
df.tail(2)

      name college                 Role
2  shivraj    COEP  Electrical Engineer
3  sushant     DYP      Silver Business

In [13]:
df.describe()

           name college             Role
count         4       4                4
unique        4       4                3
top     shriram   PCCOE  Silver Business
freq          1       1                2

In [16]:
dt = pd.read_csv('friends_data.csv')

In [17]:
dt

      name college                 Role
0  shriram   PCCOE       Data Scientist
1  shrenik   Janta      Silver Business
2  shivraj    COEP  Electrical Engineer
3  sushant     DYP      Silver Business

In [18]:
dt['college']

0    PCCOE
1    Janta
2     COEP
3      DYP
Name: college, dtype: object

In [22]:
dt['college'][3] = "SICD" # Gives warning

In [23]:
dt

      name college                 Role
0  shriram   PCCOE       Data Scientist
1  shrenik   Janta      Silver Business
2  shivraj    COEP  Electrical Engineer
3  sushant    SICD      Silver Business

In [24]:
dt.index = ['first', 'second', 'third', 'forth']

In [25]:
dt

           name college                 Role
first   shriram   PCCOE       Data Scientist
second  shrenik   Janta      Silver Business
third   shivraj    COEP  Electrical Engineer
forth   sushant    SICD      Silver Business

In [26]:
type(df['name'])

pandas.core.series.Series

In [27]:
type(df)

pandas.core.frame.DataFrame

In [29]:
new_df = pd.DataFrame(np.random.rand(200, 5), index=np.arange(200))

In [30]:
new_df

            0         1         2         3         4
0    0.929633  0.393473  0.899423  0.149577  0.151211
1    0.126243  0.738683  0.518399  0.803415  0.024026
2    0.755791  0.406139  0.482242  0.866637  0.130583
3    0.191353  0.314065  0.301377  0.066291  0.589881
4    0.181292  0.089841  0.697560  0.218985  0.747192
..        ...       ...       ...       ...       ...
195  0.370583  0.317427  0.598633  0.759734  0.622426
196  0.309188  0.408922  0.573998  0.872975  0.082662
197  0.081880  0.024846  0.618598  0.711113  0.131577
198  0.884270  0.698709  0.177010  0.232955  0.484961
199  0.016847  0.143589  0.621382  0.946295  0.258360

[200 rows x 5 columns]

In [31]:
ser = np.array(np.random.rand(100))

In [32]:
ser

array([9.81732751e-01, 5.84908132e-01, 7.24909665e-01, 6.93857598e-01,
       6.78102674e-01, 4.48303441e-01, 3.87901877e-02, 6.06445310e-01,
       6.55204498e-01, 8.10484359e-01, 1.83632992e-01, 4.41599908e-01,
       5.31740697e-01, 2.07820241e-01, 2.33069549e-01, 7.65861871e-01,
       5.31979496e-01, 2.63793333e-01, 8.94608030e-01, 2.25812625e-01,
       2.93458058e-01, 8.95853392e-01, 8.12367413e-01, 9.60198654e-01,
       2.58244932e-01, 5.92542306e-01, 4.02788817e-01, 4.63672418e-01,
       8.46410983e-01, 4.08184125e-01, 9.52806460e-01, 5.46779449e-01,
       3.05748854e-01, 2.57238561e-01, 6.06998394e-01, 9.60139512e-01,
       6.06054486e-01, 5.01675606e-02, 7.62008102e-01, 3.92457686e-01,
       7.87554454e-02, 2.12819310e-01, 1.09286284e-02, 8.62958476e-01,
       2.05741584e-01, 4.45307236e-01, 8.77872154e-01, 2.05760970e-01,
       9.40125542e-01, 9.44673016e-02, 3.62228909e-01, 8.37120066e-01,
       3.36768829e-01, 3.94899609e-01, 2.23803202e-01, 9.51058191e-01,
       2.46314492e-01, 3.38682008e-01, 9.65110899e-02, 9.41963586e-01,
       9.20040325e-01, 7.13507320e-01, 9.34292795e-01, 9.72959313e-01,
       9.84418308e-01, 6.97921965e-04, 2.24013089e-02, 8.06135227e-01,
       5.47351116e-01, 7.77700784e-02, 4.82116584e-01, 6.20825843e-01,
       8.43423017e-02, 2.05366769e-02, 1.19865611e-01, 9.42508702e-01,
       1.79469732e-01, 7.22703440e-01, 8.67782741e-01, 7.38885086e-01,
       4.79235696e-01, 9.73152530e-01, 5.68775267e-01, 2.95978478e-01,
       6.56529189e-01, 4.13792873e-01, 7.72591963e-01, 1.32296819e-01,
       8.03460341e-01, 3.82049399e-01, 2.51224556e-01, 4.37128585e-01,
       5.74785395e-01, 2.62516838e-01, 9.24309675e-01, 7.22936579e-01,
       7.35723943e-01, 4.03746248e-01, 6.35410907e-01, 3.29458114e-01])

In [35]:
sers = pd.Series(np.random.rand(34), index = np.arange(34))

In [38]:
sers

0     0.316512
1     0.895440
2     0.358521
3     0.711053
4     0.818011
5     0.902248
6     0.803831
7     0.354162
8     0.962460
9     0.279987
10    0.136655
11    0.073222
12    0.015901
13    0.169023
14    0.153725
15    0.719435
16    0.999985
17    0.479426
18    0.491009
19    0.655717
20    0.993214
21    0.990406
22    0.729771
23    0.340793
24    0.722014
25    0.991145
26    0.204193
27    0.755516
28    0.254030
29    0.806378
30    0.407613
31    0.596900
32    0.366559
33    0.924927
dtype: float64

In [39]:
sers.index

Index([ 0,  1,  2,  3,  4,  5,  6,  7,  8,  9, 10, 11, 12, 13, 14, 15, 16, 17,
       18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31, 32, 33],
      dtype='int32')

In [42]:
new_df.head()

          0         1         2         3         4
0  0.929633  0.393473  0.899423  0.149577  0.151211
1  0.126243  0.738683  0.518399  0.803415  0.024026
2  0.755791  0.406139  0.482242  0.866637  0.130583
3  0.191353  0.314065  0.301377  0.066291  0.589881
4  0.181292  0.089841  0.697560  0.218985  0.747192

In [45]:
new_df.dtypes

0    float64
1    float64
2    float64
3    float64
4    float64
dtype: object

In [47]:
new_df[0][0] = "PUBG"

C:\Users\shrir\AppData\Local\Temp\ipykernel_15116\713855249.py:1: FutureWarning: ChainedAssignmentError: behaviour will change in pandas 3.0!
You are setting values through chained assignment. Currently this works in certain cases, but when using Copy-on-Write (which will become the default behaviour in pandas 3.0) this will never work to update the original DataFrame or Series, because the intermediate object on which we are setting values will behave as a copy.
A typical example is when you are setting values in a column of a DataFrame, like:

df["col"][row_indexer] = value

Use `df.loc[row_indexer, "col"] = values` instead, to perform the assignment in a single step and ensure this keeps updating the original `df`.

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

  new_df[0][0] = "PUBG"
C:\Users\shrir\AppData\Local\Temp\ipykernel_15116\713855249.py:1: FutureWarning: Setting an item of incompatible dtype is deprecated and will raise an error in a future version of pandas. Value 'PUBG' has dtype incompatible with float64, please explicitly cast to a compatible dtype first.
  new_df[0][0] = "PUBG"

In [48]:
new_df.head()

          0         1         2         3         4
0      PUBG  0.393473  0.899423  0.149577  0.151211
1  0.126243  0.738683  0.518399  0.803415  0.024026
2  0.755791  0.406139  0.482242  0.866637  0.130583
3  0.191353  0.314065  0.301377  0.066291  0.589881
4  0.181292  0.089841  0.697560  0.218985  0.747192

In [51]:
new_df.dtypes

0     object
1    float64
2    float64
3    float64
4    float64
dtype: object

In [52]:
new_df.T

,0,1,2,3,4,5,6,7,8,9,...,190,191,192,193,194,195,196,197,198,199
0,PUBG,0.126243,0.755791,0.191353,0.181292,0.360495,0.703663,0.840418,0.379216,0.33604,...,0.320932,0.596696,0.676641,0.380356,0.108776,0.370583,0.309188,0.08188,0.88427,0.016847
1,0.393473,0.738683,0.406139,0.314065,0.089841,0.350743,0.573852,0.445248,0.323912,0.855278,...,0.8778,0.262943,0.591501,0.145601,0.998582,0.317427,0.408922,0.024846,0.698709,0.143589
2,0.899423,0.518399,0.482242,0.301377,0.69756,0.570199,0.906853,0.079176,0.924054,0.862887,...,0.931144,0.842633,0.655022,0.776385,0.358346,0.598633,0.573998,0.618598,0.17701,0.621382
3,0.149577,0.803415,0.866637,0.066291,0.218985,0.711401,0.370105,0.709598,0.076703,0.373116,...,0.043564,0.930016,0.14197,0.479221,0.580404,0.759734,0.872975,0.711113,0.232955,0.946295
4,0.151211,0.024026,0.130583,0.589881,0.747192,0.230044,0.084835,0.487083,0.555869,0.405559,...,0.420652,0.861606,0.409098,0.425431,0.859509,0.622426,0.082662,0.131577,0.484961,0.25836

In [53]:
new_df.sort_index(axis = 1, ascending = False)

            4         3         2         1         0
0    0.151211  0.149577  0.899423  0.393473      PUBG
1    0.024026  0.803415  0.518399  0.738683  0.126243
2    0.130583  0.866637  0.482242  0.406139  0.755791
3    0.589881  0.066291  0.301377  0.314065  0.191353
4    0.747192  0.218985  0.697560  0.089841  0.181292
..        ...       ...       ...       ...       ...
195  0.622426  0.759734  0.598633  0.317427  0.370583
196  0.082662  0.872975  0.573998  0.408922  0.309188
197  0.131577  0.711113  0.618598  0.024846   0.08188
198  0.484961  0.232955  0.177010  0.698709   0.88427
199  0.258360  0.946295  0.621382  0.143589  0.016847

[200 rows x 5 columns]

In [54]:
new_df.sort_index(axis = 0, ascending = False)

            0         1         2         3         4
199  0.016847  0.143589  0.621382  0.946295  0.258360
198   0.88427  0.698709  0.177010  0.232955  0.484961
197   0.08188  0.024846  0.618598  0.711113  0.131577
196  0.309188  0.408922  0.573998  0.872975  0.082662
195  0.370583  0.317427  0.598633  0.759734  0.622426
..        ...       ...       ...       ...       ...
4    0.181292  0.089841  0.697560  0.218985  0.747192
3    0.191353  0.314065  0.301377  0.066291  0.589881
2    0.755791  0.406139  0.482242  0.866637  0.130583
1    0.126243  0.738683  0.518399  0.803415  0.024026
0        PUBG  0.393473  0.899423  0.149577  0.151211

[200 rows x 5 columns]

In [55]:
list("ABCDE")

['A', 'B', 'C', 'D', 'E']

In [56]:
new_df.columns

RangeIndex(start=0, stop=5, step=1)

In [57]:
new_df.columns = list("ABCDE")

In [58]:
new_df.head(2)

          A         B         C         D         E
0      PUBG  0.393473  0.899423  0.149577  0.151211
1  0.126243  0.738683  0.518399  0.803415  0.024026

In [59]:
new_df.loc[0, 'A'] = 0.3264

In [60]:
new_df.head()

          A         B         C         D         E
0    0.3264  0.393473  0.899423  0.149577  0.151211
1  0.126243  0.738683  0.518399  0.803415  0.024026
2  0.755791  0.406139  0.482242  0.866637  0.130583
3  0.191353  0.314065  0.301377  0.066291  0.589881
4  0.181292  0.089841  0.697560  0.218985  0.747192

In [62]:
new_df.loc[0,0] = 123

In [65]:
new_df.head(2)

          A         B         C         D         E      0
0    0.3264  0.393473  0.899423  0.149577  0.151211  123.0
1  0.126243  0.738683  0.518399  0.803415  0.024026    NaN

In [67]:
new_df.drop(0, axis = 1)
new_df.head(2)

          A         B         C         D         E      0
0    0.3264  0.393473  0.899423  0.149577  0.151211  123.0
1  0.126243  0.738683  0.518399  0.803415  0.024026    NaN

In [69]:
new_df.loc[[2,120], ['B', "D"]]

            B         D
0    0.393473  0.149577
120  0.610377  0.106989